//*****************************************************************************
// 定数バッファ
//*****************************************************************************


//=============================================================================
// ピクセルシェーダ
//=============================================================================
//[earlydepthstencil]
void main(in float4 inPosition      : POSITION0,
		  in float4 inPos           : POSITION1,

		  out float4 outDepth       : SV_Target)
{ 
    float depthValue = inPos.z / inPos.w;
    
    outDepth = float4(depthValue, 0.0, 0.0, 1.0);
}