#include    "Commom_Hlsl.hlsli"

//*****************************************************************************
// 定数バッファ
//*****************************************************************************




//*****************************************************************************
// グローバル変数
//*****************************************************************************
TextureCube g_Texture : register(t0);
SamplerState g_SamplerState : register(s0);


//=============================================================================
// ピクセルシェーダ
//=============================================================================
void main(PS_IN Input,

		   out float4 outDiffuse : SV_Target)
{
    outDiffuse = g_Texture.Sample(g_SamplerState, Input.WPos.xyz);

    if (outDiffuse.a <= 0.0)
        discard;

    outDiffuse *= Input.Diffuse;
}